x = 5.6761                                # قيمته 5.674 x هنا قمنا بتعريف متغير إسمه

print('round(',x,')    =', round(x))      # x لترجع أقرب قيمة لقيمة المتغير round() هنا قمنا باستدعاء الدالة
print('round(',x,', 1) =', round(x, 1))   # مع تجاهل أي عدد موجود بعد الفاصلة بعدد واحد x لترجع أقرب قيمة لقيمة المتغير round() هنا قمنا باستدعاء الدالة
print('round(',x,', 2) =', round(x, 2))   # مع تجاهل أي عدد موجود بعد الفاصلة بعددين x لترجع أقرب قيمة لقيمة المتغير round() هنا قمنا باستدعاء الدالة
print('round(',x,', 3) =', round(x, 3))   # مع تجاهل أي عدد موجود بعد الفاصلة بثلاثة أعداد x لترجع أقرب قيمة لقيمة المتغير round() هنا قمنا باستدعاء الدالة
print('round(',x,', 4) =', round(x, 4))   # مع تجاهل أي عدد موجود بعد الفاصلة بأربعة أعداد x لترجع أقرب قيمة لقيمة المتغير round() هنا قمنا باستدعاء الدالة